## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_key_vault.key_vault will be updated in-place
  ~ resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.KeyVault/vaults/ghkvnikhiltestnetworkacl"
        name                            = "ghkvnikhiltestnetworkacl"
        tags                            = {
            "branch"     = "nikhil-test-network-acl"
            "created_by" = "terraform-ci"
        }
        # (13 unchanged attributes hidden)

      ~ network_acls {
          ~ ip_rules                   = [
              - "104.208.0.0/19",
              - "104.208.32.0/20",
              - "104.43.128.0/17",
              - "104.44.88.160/27",
              - "104.44.91.160/27",
              - "104.44.92.224/27",
              - "104.44.94.80/28",
              - "128.203.128.0/17",
              - "13.104.147.128/25",
              - "13.104.219.128/25",
              - "13.105.101.48/28",
              - "13.105.101.64/26",
              - "13.105.17.192/26",
              - "13.105.24.0/24",
              - "13.105.37.0/26",
              - "13.105.53.192/26",
              - "13.105.98.160/27",
              - "13.105.98.192/28",
              - "13.105.98.224/27",
              - "13.67.128.0/20",
              - "13.67.144.0/21",
              - "13.67.152.0/24",
              - "13.67.153.0/28",
              - "13.67.153.128/25",
              - "13.67.153.32/27",
              - "13.67.153.64/26",
              - "13.67.155.0/24",
              - "13.67.156.0/22",
              - "13.67.160.0/19",
              - "13.67.192.0/18",
              - "13.86.0.0/17",
              - "13.89.0.0/16",
              - "130.131.128.0/17",
              - "131.253.36.224/27",
              - "135.233.0.0/17",
              - "151.206.85.0/24",
              - "151.206.86.0/24",
              - "157.55.108.0/23",
              - "168.61.128.0/25",
              - "168.61.128.128/28",
              - "168.61.128.160/27",
              - "168.61.128.192/26",
              - "168.61.129.0/25",
              - "168.61.129.128/26",
              - "168.61.129.208/28",
              - "168.61.129.224/27",
              - "168.61.130.128/25",
              - "168.61.130.64/26",
              - "168.61.131.0/26",
              - "168.61.131.128/25",
              - "168.61.132.0/26",
              - "168.61.144.0/20",
              - "168.61.160.0/19",
              - "168.61.208.0/20",
              - "172.168.0.0/15",
              - "172.170.0.0/16",
              - "172.171.0.0/19",
              - "172.173.64.0/18",
              - "172.173.8.0/21",
              - "172.202.0.0/17",
              - "172.212.128.0/17",
              - "193.149.72.0/21",
              - "20.106.0.0/18",
              - "20.109.192.0/18",
              - "20.112.192.0/18",
              - "20.118.0.0/18",
              - "20.118.192.0/18",
              - "20.12.128.0/17",
              - "20.135.0.0/22",
              - "20.135.188.0/22",
              - "20.135.192.0/23",
              - "20.136.3.128/25",
              - "20.136.5.0/24",
              - "20.143.4.0/24",
              - "20.143.68.0/22",
              - "20.15.128.0/17",
              - "20.150.43.128/25",
              - "20.150.58.0/24",
              - "20.150.63.0/24",
              - "20.150.77.0/24",
              - "20.150.89.0/24",
              - "20.150.95.0/24",
              - "20.153.137.0/24",
              - "20.153.22.0/24",
              - "20.157.142.0/23",
              - "20.157.163.0/24",
              - "20.157.184.0/24",
              - "20.157.251.0/24",
              - "20.157.34.0/23",
              - "20.157.73.0/24",
              - "20.157.88.0/24",
              - "20.157.91.0/24",
              - "20.184.64.0/18",
              - "20.186.192.0/18",
              - "20.190.134.0/24",
              - "20.190.155.0/24",
              - "20.201.200.0/22",
              - "20.209.142.0/23",
              - "20.209.18.0/23",
              - "20.209.184.0/23",
              - "20.209.36.0/23",
              - "20.209.98.0/23",
              - "20.221.0.0/17",
              - "20.236.192.0/18",
              - "20.29.0.0/17",
              - "20.33.13.0/24",
              - "20.33.144.0/24",
              - "20.33.15.0/24",
              - "20.33.159.0/24",
              - "20.33.206.0/24",
              - "20.33.226.0/23",
              - "20.33.243.0/24",
              - "20.33.247.0/24",
              - "20.33.248.0/22",
              - "20.33.73.0/24",
              - "20.37.128.0/18",
              - "20.38.122.0/23",
              - "20.38.176.0/21",
              - "20.38.96.0/23",
              - "20.40.192.0/18",
              - "20.44.8.0/21",
              - "20.46.224.0/19",
              - "20.47.58.0/23",
              - "20.47.78.0/23",
              - "20.60.178.0/23",
              - "20.60.18.0/24",
              - "20.60.194.0/23",
              - "20.60.240.0/23",
              - "20.60.244.0/23",
              - "20.60.30.0/23",
              - "20.80.64.0/18",
              - "20.83.0.0/18",
              - "20.84.128.0/17",
              - "20.9.0.0/17",
              - "20.95.16.0/24",
              - "20.95.27.0/24",
              - "20.95.48.0/24",
              - "20.95.55.0/24",
              - "20.95.59.0/24",
              - "20.98.128.0/18",
              - "23.100.240.0/20",
              - "23.100.80.0/21",
              - "23.101.112.0/20",
              - "23.102.202.0/24",
              - "23.99.128.0/17",
              - "4.150.128.0/18",
              - "4.150.192.0/19",
              - "4.249.128.0/17",
              - "40.113.192.0/18",
              - "40.120.164.100/30",
              - "40.120.164.104/29",
              - "40.120.164.112/31",
              - "40.120.164.118/31",
              - "40.120.164.120/29",
              - "40.120.164.128/27",
              - "40.120.164.16/29",
              - "40.120.164.160/28",
              - "40.120.164.176/31",
              - "40.120.164.180/30",
              - "40.120.164.184/30",
              - "40.120.164.188/31",
              - "40.120.164.196/30",
              - "40.120.164.2/31",
              - "40.120.164.200/29",
              - "40.120.164.208/28",
              - "40.120.164.224/31",
              - "40.120.164.228/30",
              - "40.120.164.232/30",
              - "40.120.164.236/31",
              - "40.120.164.24/30",
              - "40.120.164.240/29",
              - "40.120.164.250/31",
              - "40.120.164.252/30",
              - "40.120.164.36/30",
              - "40.120.164.4/30",
              - "40.120.164.40/29",
              - "40.120.164.48/29",
              - "40.120.164.56/31",
              - "40.120.164.66/31",
              - "40.120.164.68/30",
              - "40.120.164.72/30",
              - "40.120.164.76/31",
              - "40.120.164.8/29",
              - "40.120.164.80/28",
              - "40.120.165.0/25",
              - "40.120.165.128/26",
              - "40.120.165.192/27",
              - "40.120.165.224/28",
              - "40.120.165.240/31",
              - "40.120.165.244/30",
              - "40.120.165.248/29",
              - "40.120.166.0/27",
              - "40.120.166.128/26",
              - "40.120.166.192/27",
              - "40.120.166.224/30",
              - "40.120.166.230/31",
              - "40.120.166.232/29",
              - "40.120.166.240/28",
              - "40.120.166.32/30",
              - "40.120.166.40/29",
              - "40.120.166.48/28",
              - "40.120.166.64/31",
              - "40.120.166.68/30",
              - "40.120.166.72/29",
              - "40.120.166.80/28",
              - "40.120.166.96/27",
              - "40.120.167.0/26",
              - "40.120.167.64/29",
              - "40.120.167.72/30",
              - "40.122.128.0/17",
              - "40.122.16.0/20",
              - "40.122.32.0/19",
              - "40.122.64.0/18",
              - "40.123.168.0/24",
              - "40.123.169.0/30",
              - "40.123.169.104/31",
              - "40.123.169.108/30",
              - "40.123.169.112/28",
              - "40.123.169.140/30",
              - "40.123.169.144/28",
              - "40.123.169.16/28",
              - "40.123.169.160/27",
              - "40.123.169.192/26",
              - "40.123.169.32/27",
              - "40.123.169.6/31",
              - "40.123.169.64/27",
              - "40.123.169.8/29",
              - "40.123.169.96/29",
              - "40.123.170.0/29",
              - "40.123.170.104/30",
              - "40.123.170.108/31",
              - "40.123.170.116/30",
              - "40.123.170.12/31",
              - "40.123.170.120/29",
              - "40.123.170.130/31",
              - "40.123.170.132/30",
              - "40.123.170.136/29",
              - "40.123.170.144/28",
              - "40.123.170.160/28",
              - "40.123.170.176/29",
              - "40.123.170.184/31",
              - "40.123.170.192/31",
              - "40.123.170.196/30",
              - "40.123.170.200/29",
              - "40.123.170.208/29",
              - "40.123.170.216/30",
              - "40.123.170.22/31",
              - "40.123.170.220/31",
              - "40.123.170.224/27",
              - "40.123.170.24/29",
              - "40.123.170.32/28",
              - "40.123.170.52/30",
              - "40.123.170.8/30",
              - "40.123.170.86/31",
              - "40.123.170.88/29",
              - "40.123.170.96/29",
              - "40.123.171.0/24",
              - "40.126.27.0/24",
              - "40.126.6.0/24",
              - "40.64.145.176/28",
              - "40.64.163.0/25",
              - "40.67.160.0/19",
              - "40.69.128.0/18",
              - "40.77.0.0/17",
              - "40.77.130.128/26",
              - "40.77.137.0/25",
              - "40.77.138.0/25",
              - "40.77.161.64/26",
              - "40.77.166.192/26",
              - "40.77.171.0/24",
              - "40.77.175.192/27",
              - "40.77.175.240/28",
              - "40.77.182.16/28",
              - "40.77.182.192/26",
              - "40.77.184.128/25",
              - "40.77.197.0/24",
              - "40.77.255.128/26",
              - "40.78.128.0/18",
              - "40.78.221.0/24",
              - "40.82.16.0/22",
              - "40.82.96.0/22",
              - "40.83.0.0/20",
              - "40.83.16.0/21",
              - "40.83.24.0/26",
              - "40.83.24.128/25",
              - "40.83.24.64/27",
              - "40.83.25.0/24",
              - "40.83.26.0/23",
              - "40.83.28.0/22",
              - "40.83.32.0/19",
              - "40.86.0.0/17",
              - "40.87.180.0/30",
              - "40.87.180.128/26",
              - "40.87.180.14/31",
              - "40.87.180.16/30",
              - "40.87.180.192/30",
              - "40.87.180.20/31",
              - "40.87.180.202/31",
              - "40.87.180.204/30",
              - "40.87.180.208/28",
              - "40.87.180.224/28",
              - "40.87.180.240/29",
              - "40.87.180.248/30",
              - "40.87.180.28/30",
              - "40.87.180.32/29",
              - "40.87.180.4/31",
              - "40.87.180.42/31",
              - "40.87.180.44/30",
              - "40.87.180.48/28",
              - "40.87.180.64/30",
              - "40.87.180.74/31",
              - "40.87.180.76/30",
              - "40.87.180.80/28",
              - "40.87.180.96/27",
              - "40.87.181.128/28",
              - "40.87.181.144/29",
              - "40.87.181.152/31",
              - "40.87.181.16/28",
              - "40.87.181.162/31",
              - "40.87.181.164/30",
              - "40.87.181.168/29",
              - "40.87.181.176/28",
              - "40.87.181.192/26",
              - "40.87.181.32/27",
              - "40.87.181.4/30",
              - "40.87.181.64/26",
              - "40.87.181.8/29",
              - "40.87.182.128/25",
              - "40.87.182.24/29",
              - "40.87.182.32/28",
              - "40.87.182.4/30",
              - "40.87.182.48/29",
              - "40.87.182.56/30",
              - "40.87.182.62/31",
              - "40.87.182.64/26",
              - "40.87.182.8/29",
              - "40.87.183.0/28",
              - "40.87.183.144/28",
              - "40.87.183.16/29",
              - "40.87.183.160/27",
              - "40.87.183.192/27",
              - "40.87.183.224/29",
              - "40.87.183.232/30",
              - "40.87.183.236/31",
              - "40.87.183.24/30",
              - "40.87.183.244/30",
              - "40.87.183.248/29",
              - "40.87.183.34/31",
              - "40.87.183.36/30",
              - "40.87.183.42/31",
              - "40.87.183.44/30",
              - "40.87.183.54/31",
              - "40.87.183.56/29",
              - "40.87.183.64/26",
              - "40.89.224.0/19",
              - "40.90.129.224/27",
              - "40.90.130.192/28",
              - "40.90.130.64/28",
              - "40.90.132.192/26",
              - "40.90.137.224/27",
              - "40.90.140.224/27",
              - "40.90.140.96/27",
              - "40.90.141.0/27",
              - "40.90.142.128/27",
              - "40.90.142.240/28",
              - "40.90.144.0/27",
              - "40.90.144.128/26",
              - "40.90.148.176/28",
              - "40.90.149.96/27",
              - "40.90.151.144/28",
              - "40.90.154.64/26",
              - "40.90.156.192/26",
              - "40.90.158.64/26",
              - "40.90.16.0/27",
              - "40.90.21.128/25",
              - "40.90.22.0/25",
              - "40.90.26.128/25",
              - "40.93.13.0/24",
              - "40.93.192.0/24",
              - "40.93.8.0/24",
              - "40.97.12.0/24",
              - "40.97.55.128/25",
              - "40.97.55.64/26",
              - "40.97.7.0/24",
              - "48.208.55.0/24",
              - "48.208.56.0/23",
              - "48.208.58.0/24",
              - "48.214.128.0/17",
              - "51.5.24.0/24",
              - "51.5.255.240/28",
              - "52.101.32.0/22",
              - "52.101.61.0/24",
              - "52.101.62.0/23",
              - "52.101.64.0/24",
              - "52.101.8.0/24",
              - "52.102.130.0/24",
              - "52.102.139.0/24",
              - "52.103.13.0/24",
              - "52.103.130.0/24",
              - "52.103.139.0/24",
              - "52.103.4.0/24",
              - "52.106.0.0/24",
              - "52.106.10.0/23",
              - "52.106.5.0/24",
              - "52.108.165.0/24",
              - "52.108.166.0/23",
              - "52.108.185.0/24",
              - "52.108.208.0/21",
              - "52.109.8.0/22",
              - "52.111.227.0/24",
              - "52.112.113.0/24",
              - "52.112.72.0/24",
              - "52.113.129.0/24",
              - "52.114.128.0/22",
              - "52.115.76.0/22",
              - "52.115.88.0/22",
              - "52.115.92.0/24",
              - "52.123.12.0/24",
              - "52.123.185.0/24",
              - "52.123.186.0/24",
              - "52.123.2.0/24",
              - "52.125.128.0/22",
              - "52.136.30.0/24",
              - "52.141.192.0/19",
              - "52.141.240.0/20",
              - "52.143.193.0/24",
              - "52.143.224.0/19",
              - "52.154.0.0/18",
              - "52.154.128.0/17",
              - "52.158.160.0/20",
              - "52.158.192.0/19",
              - "52.165.0.0/19",
              - "52.165.104.0/25",
              - "52.165.128.0/17",
              - "52.165.32.0/20",
              - "52.165.48.0/28",
              - "52.165.49.0/24",
              - "52.165.56.0/21",
              - "52.165.64.0/19",
              - "52.165.96.0/21",
              - "52.173.0.0/16",
              - "52.176.0.0/17",
              - "52.176.128.0/19",
              - "52.176.160.0/21",
              - "52.176.176.0/20",
              - "52.176.192.0/19",
              - "52.176.224.0/24",
              - "52.180.128.0/19",
              - "52.180.184.0/27",
              - "52.180.184.32/28",
              - "52.180.185.0/24",
              - "52.182.128.0/17",
              - "52.185.0.0/19",
              - "52.185.112.0/26",
              - "52.185.112.96/27",
              - "52.185.120.0/21",
              - "52.185.32.0/20",
              - "52.185.48.0/21",
              - "52.185.56.0/26",
              - "52.185.56.128/27",
              - "52.185.56.160/28",
              - "52.185.56.64/27",
              - "52.185.56.96/28",
              - "52.185.64.0/19",
              - "52.185.96.0/20",
              - "52.189.0.0/17",
              - "52.228.128.0/17",
              - "52.230.128.0/17",
              - "52.232.157.0/24",
              - "52.238.192.0/18",
              - "52.239.150.0/23",
              - "52.239.177.128/25",
              - "52.239.177.32/27",
              - "52.239.177.64/26",
              - "52.239.195.0/24",
              - "52.239.234.0/23",
              - "52.242.128.0/17",
              - "52.245.68.0/24",
              - "52.245.69.144/28",
              - "52.245.69.160/27",
              - "52.245.69.192/26",
              - "52.245.69.32/27",
              - "52.245.69.64/27",
              - "52.245.69.96/28",
              - "52.245.70.0/23",
              - "52.255.0.0/19",
              - "57.150.104.0/23",
              - "57.150.128.0/23",
              - "57.150.134.0/23",
              - "57.150.140.0/22",
              - "57.150.144.0/23",
              - "57.150.160.0/23",
              - "57.150.192.0/23",
              - "57.150.42.0/23",
              - "57.150.96.0/23",
              - "64.236.0.0/17",
              - "65.55.144.0/23",
              - "65.55.146.0/24",
              - "70.152.104.0/23",
              - "70.152.7.0/24",
              - "70.152.91.0/24",
              - "70.152.92.0/22",
              - "70.152.96.0/21",
              - "72.152.0.0/17",
              - "74.249.128.0/17",
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # module.terraform-azure-collection.azurerm_key_vault_access_policy.app will be created
  + resource "azurerm_key_vault_access_policy" "app" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.KeyVault/vaults/ghkvnikhiltestnetworkacl"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Backup",
          + "Restore",
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Purge",
        ]
      + tenant_id          = "81665909-a4e6-466b-9671-4d9ef491267f"
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_password will be created
  + resource "azurerm_key_vault_secret" "observe_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.KeyVault/vaults/ghkvnikhiltestnetworkacl"
      + name                    = "observe-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.terraform-azure-collection.azurerm_key_vault_secret.observe_token will be created
  + resource "azurerm_key_vault_secret" "observe_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.KeyVault/vaults/ghkvnikhiltestnetworkacl"
      + name                    = "observe-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be created
  + resource "azurerm_linux_function_app" "observe_collect_function_app" {
      + app_settings                                   = (known after apply)
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "centralus"
      + name                                           = "gh-fa-nikhil-test-network-acl"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "gh-rg-nikhil-test-network-acl"
      + service_plan_id                                = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.Web/serverFarms/gh-sp-nikhil-test-network-acl"
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "ghsanikhiltestnetworkacl"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "branch"     = "nikhil-test-network-acl"
          + "created_by" = "terraform-ci"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + python_version              = "3.9"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.terraform-azure-collection.azurerm_monitor_diagnostic_setting.observe_collect_function_app[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "observe_collect_function_app" {
      + eventhub_authorization_rule_id = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-test-network-acl/providers/Microsoft.EventHub/namespaces/gh-ehns-nikhil-test-network-acl/authorizationRules/RootManageSharedAccessKey"
      + eventhub_name                  = "gh-eh-nikhil-test-network-acl"
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "gh-fa-ds-nikhil-test-network-acl"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "FunctionAppLogs"
            # (1 unchanged attribute hidden)
        }

      + log (known after apply)

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```
</details>